Model: "gunet_ch-16_ln-5_bs-2_ks-3_mf-2_af-relu_sc-add_rb-true"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
inputs (InputLayer)             [(None, 608, 1600, 2 0                                            
__________________________________________________________________________________________________
channel_expansion2d (ChannelExp (None, 608, 1600, 16 32          inputs[0][0]                     
__________________________________________________________________________________________________
res_conv2d_block (ResConv2DBloc (None, 608, 1600, 16 4640        channel_expansion2d[0][0]        
__________________________________________________________________________________________________
down_scaling2d (DownScaling2D)  (None, 304, 800, 32) 4640        res_conv2d_block[0][0]           
__________________________________________________________________________________________________
res_conv2d_block_1 (ResConv2DBl (None, 304, 800, 32) 18496       down_scaling2d[0][0]             
__________________________________________________________________________________________________
down_scaling2d_1 (DownScaling2D (None, 152, 400, 64) 18496       res_conv2d_block_1[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_2 (ResConv2DBl (None, 152, 400, 64) 73856       down_scaling2d_1[0][0]           
__________________________________________________________________________________________________
down_scaling2d_2 (DownScaling2D (None, 76, 200, 128) 73856       res_conv2d_block_2[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_3 (ResConv2DBl (None, 76, 200, 128) 295168      down_scaling2d_2[0][0]           
__________________________________________________________________________________________________
down_scaling2d_3 (DownScaling2D (None, 38, 100, 256) 295168      res_conv2d_block_3[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_4 (ResConv2DBl (None, 38, 100, 256) 1180160     down_scaling2d_3[0][0]           
__________________________________________________________________________________________________
up_scaling2d (UpScaling2D)      (None, 76, 200, 128) 295040      res_conv2d_block_4[0][0]         
__________________________________________________________________________________________________
skip_add (SkipAdd)              (None, 76, 200, 128) 0           up_scaling2d[0][0]               
                                                                 res_conv2d_block_3[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_5 (ResConv2DBl (None, 76, 200, 128) 295168      skip_add[0][0]                   
__________________________________________________________________________________________________
up_scaling2d_1 (UpScaling2D)    (None, 152, 400, 64) 73792       res_conv2d_block_5[0][0]         
__________________________________________________________________________________________________
skip_add_1 (SkipAdd)            (None, 152, 400, 64) 0           up_scaling2d_1[0][0]             
                                                                 res_conv2d_block_2[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_6 (ResConv2DBl (None, 152, 400, 64) 73856       skip_add_1[0][0]                 
__________________________________________________________________________________________________
up_scaling2d_2 (UpScaling2D)    (None, 304, 800, 32) 18464       res_conv2d_block_6[0][0]         
__________________________________________________________________________________________________
skip_add_2 (SkipAdd)            (None, 304, 800, 32) 0           up_scaling2d_2[0][0]             
                                                                 res_conv2d_block_1[0][0]         
__________________________________________________________________________________________________
res_conv2d_block_7 (ResConv2DBl (None, 304, 800, 32) 18496       skip_add_2[0][0]                 
__________________________________________________________________________________________________
up_scaling2d_3 (UpScaling2D)    (None, 608, 1600, 16 4624        res_conv2d_block_7[0][0]         
__________________________________________________________________________________________________
skip_add_3 (SkipAdd)            (None, 608, 1600, 16 0           up_scaling2d_3[0][0]             
                                                                 res_conv2d_block[0][0]           
__________________________________________________________________________________________________
res_conv2d_block_8 (ResConv2DBl (None, 608, 1600, 16 4640        skip_add_3[0][0]                 
__________________________________________________________________________________________________
channel_contraction2d (ChannelC (None, 608, 1600, 2) 32          res_conv2d_block_8[0][0]         
__________________________________________________________________________________________________
skip_add_4 (SkipAdd)            (None, 608, 1600, 2) 0           channel_contraction2d[0][0]      
                                                                 inputs[0][0]                     
==================================================================================================
Total params: 2,748,624
Trainable params: 2,748,624
Non-trainable params: 0
__________________________________________________________________________________________________
