{
    "class_name": "Model",
    "config": {
        "name": "gunet_ch-16_ln-5_bs-2_ks-3_mf-2_af-relu_sc-add_rb-true",
        "layers": [
            {
                "name": "inputs",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        608,
                        1600,
                        2
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "inputs"
                },
                "inbound_nodes": []
            },
            {
                "name": "channel_expansion2d",
                "class_name": "ChannelExpansion2D",
                "config": {
                    "name": "channel_expansion2d",
                    "trainable": true,
                    "dtype": "float32",
                    "channels": 16,
                    "kernel_size": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": null,
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": false,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "inputs",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "channel_expansion2d",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "down_scaling2d",
                "class_name": "DownScaling2D",
                "config": {
                    "name": "down_scaling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_1",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_1",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "down_scaling2d",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "down_scaling2d_1",
                "class_name": "DownScaling2D",
                "config": {
                    "name": "down_scaling2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_2",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_2",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "down_scaling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "down_scaling2d_2",
                "class_name": "DownScaling2D",
                "config": {
                    "name": "down_scaling2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_3",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_3",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "down_scaling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "down_scaling2d_3",
                "class_name": "DownScaling2D",
                "config": {
                    "name": "down_scaling2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_4",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_4",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "down_scaling2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "up_scaling2d",
                "class_name": "UpScaling2D",
                "config": {
                    "name": "up_scaling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "skip_add",
                "class_name": "SkipAdd",
                "config": {
                    "name": "skip_add",
                    "trainable": false,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "up_scaling2d",
                            0,
                            0,
                            {}
                        ],
                        [
                            "res_conv2d_block_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_5",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_5",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "skip_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "up_scaling2d_1",
                "class_name": "UpScaling2D",
                "config": {
                    "name": "up_scaling2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "skip_add_1",
                "class_name": "SkipAdd",
                "config": {
                    "name": "skip_add_1",
                    "trainable": false,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "up_scaling2d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "res_conv2d_block_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_6",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_6",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "skip_add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "up_scaling2d_2",
                "class_name": "UpScaling2D",
                "config": {
                    "name": "up_scaling2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "skip_add_2",
                "class_name": "SkipAdd",
                "config": {
                    "name": "skip_add_2",
                    "trainable": false,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "up_scaling2d_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "res_conv2d_block_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_7",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_7",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "skip_add_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "up_scaling2d_3",
                "class_name": "UpScaling2D",
                "config": {
                    "name": "up_scaling2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "factor": 2,
                    "channel_factor": 2,
                    "kernel_size": 3,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": true,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "skip_add_3",
                "class_name": "SkipAdd",
                "config": {
                    "name": "skip_add_3",
                    "trainable": false,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "up_scaling2d_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "res_conv2d_block",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res_conv2d_block_8",
                "class_name": "ResConv2DBlock",
                "config": {
                    "name": "res_conv2d_block_8",
                    "trainable": true,
                    "dtype": "float32",
                    "conv_number": 2,
                    "filters": null,
                    "kernel_size": 3,
                    "strides": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": "glorot_uniform",
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "skip_add_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "channel_contraction2d",
                "class_name": "ChannelContraction2D",
                "config": {
                    "name": "channel_contraction2d",
                    "trainable": true,
                    "dtype": "float32",
                    "channels": 2,
                    "kernel_size": 1,
                    "padding": "same",
                    "data_format": "channels_last",
                    "activation": null,
                    "kernel_initializer": "glorot_uniform",
                    "use_bias": false,
                    "bias_initializer": "zeros",
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res_conv2d_block_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "skip_add_4",
                "class_name": "SkipAdd",
                "config": {
                    "name": "skip_add_4",
                    "trainable": false,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "channel_contraction2d",
                            0,
                            0,
                            {}
                        ],
                        [
                            "inputs",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "inputs",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "skip_add_4",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow"
}